{"Shader":{"ver":"0.1","info":{"id":"lstGRB","date":"1450743299","viewed":275,"name":"Transparent 3D Noise","username":"Shane","description":"Raymarching some transparent 3D noise.","likes":23,"published":3,"flags":0,"tags":["3d","raymarching","noise","transparency","volumetric"],"hasliked":0},"renderpass":[{"inputs":[],"outputs":[{"channel":"0"}],"code":"\/*\n\t\n    Transparent 3D Noise\n\t--------------------\n\n\tOn occasion, I use this simple transparent setup to visualize certain 3D algorithms.\n\tObviously, it wouldn't pass for proper transparency, but to be fair, it's not running \n\tat minus 2 frames per second either. :)\n\n\tHere, it's being used to render stock standard, smooth, 3D value noise.\n\n\tI'm using a variation on IQ's textureless version. It does the same thing, but is \n\twritten in a more succinct, self contained form. I couldn't say whether it's faster \n\tor not (probably not), but it's faster to cut and paste, so that's almost the same \n\tthing. :)\n\n\tSeriously, though, it's reasonably quick, but I'm hoping some clever soul might know \n\tof a way to improve it.\n\n\tIQ's really fast, textureless version is there as well, but it's commented out. If \n\tyou require more speed, that's the one to use.\n\n\tIn regards to the transparency itself, there are a bunch of variables that effect the\n\toverall look. Too many to mention, in fact. The easiest way to get accustomed to\n\tthem all is to change them and see what happens.\n\n\tRelated shaders:\n\n\tCloudy Spikeball - Duke\n    https:\/\/www.shadertoy.com\/view\/MljXDw\n    \/\/ Port from a demo by Las - Worth watching.\n    \/\/ http:\/\/www.pouet.net\/topic.php?which=7920&page=29&x=14&y=9\n\n\tVirtually the same thing, but with rounded cubes.\n\tTransparent Cube Field - Shane\n\thttps:\/\/www.shadertoy.com\/view\/ll2SRy\n\t\n*\/\n\n\n\n\/\/ Cheap vec3 to vec3 hash. Works well enough, but there are other ways.\nvec3 hash33(vec3 p){ \n    \n    float n = sin(dot(p, vec3(7, 157, 113)));    \n    return fract(vec3(2097152, 262144, 32768)*n); \n}\n\n\/*\n\/\/ IQ's texture lookup noise... in obfuscated form. There's less writing, so\n\/\/ that makes it faster. That's how optimization works, right? :) Seriously,\n\/\/ though, refer to IQ's original for the proper function.\n\/\/ \n\/\/ By the way, I have tried to better this formula with a textureless version, \n\/\/ but so far, nothing comes close. If you're after speed, this is the one\n\/\/ to use... or improve on, if you can. :)\n\/\/\n\/\/ If not loaded, you need to load up the correct noise texture with this one. \n\/\/ It's important that the \"vFlip\" checkbox is unchecked, also.\nfloat noise3DTex( in vec3 p ){\n    \n    vec3 i = floor(p); p -= i; p *= p*(3. - 2.*p);\n\tp.xy = texture2D(iChannel0, (p.xy + i.xy + vec2(37, 17)*i.z + .5)\/256., -100.).yx;\n\treturn mix(p.x, p.y, p.z);\n}\n*\/\n\n\/\/ This is a rewrite of IQ's original. It's self contained, which makes it much\n\/\/ easier to copy and paste. I've also tried my best to minimize the amount of \n\/\/ operations to lessen the work the GPU has to do, but I think there's room for\n\/\/ improvement. I have no idea whether it's faster or not. It could be slower,\n\/\/ for all I know, but it doesn't really matter, because in its current state, \n\/\/ it's still no match for IQ's texture-based, smooth 3D value noise.\n\/\/\n\/\/ By the way, a few people have managed to reduce the original down to this state, \n\/\/ but I haven't come across any who have taken it further. If you know of any, I'd\n\/\/ love to hear about it.\n\/\/\n\/\/ I've tried to come up with some clever way to improve the randomization line\n\/\/ (h = mix(fract...), but so far, nothing's come to mind.\nfloat noise3D(vec3 p){\n    \n    \/\/ Just some random figures, analogous to stride. You can change this, if you want.\n\tconst vec3 s = vec3(7, 157, 113);\n\t\n\tvec3 ip = floor(p); \/\/ Unique unit cell ID.\n    \n    \/\/ Setting up the stride vector for randomization and interpolation, kind of. \n    \/\/ All kinds of shortcuts are taken here. Refer to IQ's original formula.\n    vec4 h = vec4(0., s.yz, s.y + s.z) + dot(ip, s);\n    \n\tp -= ip; \/\/ Cell's fractional component.\n\t\n    \/\/ A bit of cubic smoothing, to give the noise that rounded look.\n    p = p*p*(3. - 2.*p);\n    \n    \/\/ Smoother version of the above. Weirdly, the extra calculations can sometimes\n    \/\/ create a surface that's easier to hone in on, and can actually speed things up.\n    \/\/ Having said that, I'm sticking with the simpler version above.\n\t\/\/p = p*p*p*(p*(p * 6. - 15.) + 10.);\n    \n    \/\/ Even smoother, but this would have to be slower, surely?\n\t\/\/vec3 p3 = p*p*p; p = ( 7. + ( p3 - 7. ) * p ) * p3;\t\n\t\n    \/\/ Cosinusoidal smoothing. OK, but I prefer other methods.\n    \/\/p = .5 - .5*cos(p*3.14159);\n    \n    \/\/ Standard 3D noise stuff. Retrieving 8 random scalar values for each cube corner,\n    \/\/ then interpolating along X. There are countless ways to randomize, but this is\n    \/\/ the way most are familar with: fract(sin(x)*largeNumber).\n    h = mix(fract(sin(h)*43758.5453), fract(sin(h + s.x)*43758.5453), p.x);\n\t\n    \/\/ Interpolating along Y.\n    h.xy = mix(h.xz, h.yw, p.y);\n    \n    \/\/ Interpolating along Z, and returning the 3D noise value.\n    return mix(h.x, h.y, p.z); \/\/ Range: [0, 1].\n\t\n}\n\nfloat map(vec3 p){\n    \n    \/\/ One layer of noise at isolevel \"0.3\" - I have no idea whether that's the\n    \/\/ correct terminology. :)\n    return noise3D(p*2.) - .3;\n    \n    \/\/ Two layers. The texture based 3D algorithm does this with ease, even on\n    \/\/ slower machines, but the function based one starts having trouble. \n    \/\/ By the way, you need to load up the correct noise texture with the correct \n    \/\/ \"vFlip\" setting, if you wish to use this.\n    \/\/return noise3DTex(p*2.)*.66 + noise3DTex(p*4.)*.34 - .4;\n\t\n}\n\n\n\nvoid mainImage( out vec4 fragColor, vec2 fragCoord ) {\n\n    \n    \/\/ Screen coordinates.\n\tvec2 uv = (fragCoord.xy - iResolution.xy*.5 )\/iResolution.y;\n\t\n    \/\/ Unit direction ray. The last term is one of many ways to fish-lens the camera.\n    \/\/ For a regular view, set \"rd.z\" to something like \"0.5.\"\n    vec3 rd = normalize(vec3(uv, (1.-dot(uv, uv)*.5)*.5)); \/\/ Fish lens, for that 1337, but tryhardish, demo look. :)\n    \n    \/\/ There are a few ways to hide artifacts and inconsistencies. Making things go fast is one of them. :)\n    \/\/ Ray origin, scene color, and surface postion vector.\n    vec3 ro = vec3(0., iGlobalTime*1.5, iGlobalTime*1.5), col=vec3(0), sp;\n\t\n    \/\/ Swivel the unit ray to look around the scene.\n    \/\/ Compact 2D rotation matrix, courtesy of Shadertoy user, \"Fabrice Neyret.\"\n    vec2 a = sin(vec2(1.5707963, 0) + iGlobalTime*0.375);\n    rd.xz = mat2(a, -a.y, a.x)*rd.xz;    \n    rd.xy = mat2(a, -a.y, a.x)*rd.xy; \n    \n    \n    \/\/ Unit ray jitter is another way to hide artifacts. It can also trick the viewer into believing\n    \/\/ something hard core, like global illumination, is happening. :)\n    rd *= 0.99 + hash33(rd)*0.02;\n    \n    \/\/ Some more randomization, to be used for color based jittering inside the loop.\n    vec3 rnd = hash33(rd+311.);\n    \n    \n\t\/\/ Ray distance, bail out layer number, surface distance and normalized accumulated distance.\n\tfloat t=0., layers=0., d, aD;\n    \n    \/\/ Surface distance threshold. Smaller numbers gives a thinner membrane, but lessens detail... \n    \/\/ hard to explain. It's easier to check it out for yourself.\n    float thD = .025; \/\/ + smoothstep(-0.2, 0.2, sin(iGlobalTime*0.75 - 3.14159*0.4))*0.025;\n \n\t\n    \/\/ Only a few iterations seemed to be enough. Obviously, more looks better, but is slower.\n\tfor(float i=0.; i<56.; i++)\t{\n        \n        \/\/ Break conditions. Anything that can help you bail early usually increases frame rate.\n        if(layers>23. || col.x > 1. || t>10.) break;\n        \n        \/\/ Current ray postion. Slightly redundant here, but sometimes you may wish to reuse\n        \/\/ it during the accumulation stage.\n        sp = ro+rd*t;\n\t\t\n        d = map(sp); \/\/ Distance to nearest point on the noise surface.\n        \n        \/\/ If we get within a certain distance of the surface, accumulate some surface values.\n        \/\/ Values further away have less influence on the total.\n        \/\/\n        \/\/ aD - Accumulated distance. You could smoothly interpolate it, if you wanted.\n        \/\/\n        \/\/ 1\/.(1. + t*t*0.1) - Basic distance attenuation. Feel free to substitute your own.\n        \n         \/\/ Normalized distance from the surface threshold value to our current isosurface value.\n        aD = (thD-abs(d)*23.\/24.)\/thD;\n        \n        \/\/ If we're within the surface threshold, accumulate some color.\n        \/\/ Two \"if\" statements in a shader loop makes me nervous. I don't suspect there'll be any\n        \/\/ problems, but if there are, let us know.\n        if(aD>0.) { \n            \n            \/\/ Add the accumulated surface distance value, along with some basic falloff (fog, if \n            \/\/ you prefer) using the camera to surface distance, \"t.\" If you wanted, you could\n            \/\/ add a light, and use the light position to ray position distance instead.\n            \/\/ There's a bit of color jitter there, too.\n            \n            \/\/col += aD*aD*(3.-2.*aD)\/(1. + t*t*0.125)*.1 + (fract(rnd + i*27.)-.5)*0.02;\n            \n            col += aD\/(1. + t*t*0.1)*.1 + (fract(rnd + i*27.)-.5)*0.02;\n            \n            \/\/ The layer number is worth noting. Accumulating more layers gives a bit more glow.\n            \/\/ Lower layer numbers allow a quicker bailout. A lot of it is guess work.\n            layers++;  \n        }\n\n\t\t\n        \/\/ Kind of weird the way this works. I think not allowing the ray to hone in properly is\n        \/\/ the very thing that gives an even spread of values. The figures are based on a bit \n        \/\/ of knowledge versus trial and error. If you have a faster computer, feel free to tweak\n        \/\/ them a bit.\n        t += max(d*.7, thD*.7); \n        \n\t\t\t    \n\t}\n    \n     \n    \n    \/\/ Mixing the greytone color with a firey orange vignette. There's no meaning\n    \/\/ behind it. I just thought the artsy greyscale was a little too artsy.\n    uv = abs(fragCoord.xy\/iResolution.xy - .5); \/\/ Wasteful, but the GPU can handle it.\n    col = mix(col, vec3(min(col.x*1.5, 1.), pow(col.x, 2.5), pow(col.x, 12.)),\n               min( dot(pow(uv, vec2(4.)), vec2(1))*8., 1.));\n\n    \n\t\/\/ Mixing the vignette colors up a bit more.\n    col = mix(col, col.xzy, dot(sin(rd*5.), vec3(.166)) + 0.166);\n    \n\t\/\/ Presenting the color to the screen.\n\tfragColor = vec4( clamp(col, 0., 1.), 1.0 );\n    \n     \n }\n","name":"","description":"","type":"image"}]}}